// По предыдущему заданию:
// Крутой способ вывести синхронизацию отдельно на метод.

// В реальных проектах логика параллельной работы во много раз сложнее, 
// поэтому и выявлять баги существенно труднее, и тесты не особо помогают, 
// так как часто невозможно смоделировать конкретные ситуации, завязанные на микро(милли)секундные шаги.
// И иногда возникает вопрос действительно использование многопоточности так необходимо?
// Выглядит всегда круто, но хотя бы с линейным разобраться
//---------------------------
